#Использовать asserts
#Использовать compressor

&Тест
Процедура Должен_ПроверитьУпаковкуРаспаковкуДвоичныхДанныхВДвоичныеДанные() Экспорт

	Компрессоры = Компрессоры();
	ИсходныеДанные = ТестовыеДвоичныеДанные();

	Для Каждого Компрессор Из Компрессоры Цикл
		УпакованныеДанные = Компрессор.Упаковать(ИсходныеДанные);
		РаспакованныеДанные = Компрессор.Распаковать(УпакованныеДанные);

		Ожидаем.Что(РаспакованныеДанные, Компрессор).Равно(ИсходныеДанные);
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура Должен_ПроверитьУпаковкуСУказаниемУровняСжатия() Экспорт

	ИсходныеДанные = ТестовыеДвоичныеДанные();

	Компрессоры = Новый Массив();
	Компрессоры.Добавить(Новый GZipКомпрессор(УровеньСжатияДанных.Оптимальный));
	Компрессоры.Добавить(Новый GZipКомпрессор(УровеньСжатияДанных.Быстрый));
	Компрессоры.Добавить(Новый GZipКомпрессор(УровеньСжатияДанных.БезСжатия));
	Компрессоры.Добавить(Новый DeflateКомпрессор(УровеньСжатияДанных.Оптимальный));
	Компрессоры.Добавить(Новый DeflateКомпрессор(УровеньСжатияДанных.Быстрый));
	Компрессоры.Добавить(Новый DeflateКомпрессор(УровеньСжатияДанных.БезСжатия));
	Компрессоры.Добавить(Новый BrotliКомпрессор(УровеньСжатияДанных.Оптимальный));
	Компрессоры.Добавить(Новый BrotliКомпрессор(УровеньСжатияДанных.Быстрый));
	Компрессоры.Добавить(Новый BrotliКомпрессор(УровеньСжатияДанных.БезСжатия));

	Для Каждого Компрессор Из Компрессоры Цикл
		УпакованныеДанные = Компрессор.Упаковать(ИсходныеДанные);
		РаспакованныеДанные = Компрессор.Распаковать(УпакованныеДанные);

		Ожидаем.Что(РаспакованныеДанные, Компрессор).Равно(ИсходныеДанные);
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура Должен_ПроверитьУпаковкуРаспаковкуДвоичныхДанныхВПоток() Экспорт

	Компрессоры = Компрессоры();
	ИсходныеДанные = ТестовыеДвоичныеДанные();

	Для Каждого Компрессор Из Компрессоры Цикл
		Поток = Новый ПотокВПамяти();
		Компрессор.Упаковать(ИсходныеДанные, Поток);
		УпакованныеДанные = Поток.ЗакрытьИПолучитьДвоичныеДанные();

		Поток = Новый ПотокВПамяти();
		Компрессор.Распаковать(УпакованныеДанные, Поток);
		РаспакованныеДанные = Поток.ЗакрытьИПолучитьДвоичныеДанные();

		Ожидаем.Что(РаспакованныеДанные, Компрессор).Равно(ИсходныеДанные);
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура Должен_ПроверитьУпаковкуРаспаковкуПотокаВДвоичныеДанные() Экспорт

	Компрессоры = Компрессоры();
	ИсходныеДанные = ТестовыеДвоичныеДанные();

	Для Каждого Компрессор Из Компрессоры Цикл
		Буфер = ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(ИсходныеДанные);
		Поток = Новый ПотокВПамяти(Буфер);
		УпакованныеДанные = Компрессор.Упаковать(Поток);

		Буфер = ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(УпакованныеДанные);
		Поток = Новый ПотокВПамяти(Буфер);
		РаспакованныеДанные = Компрессор.Распаковать(Поток);

		Ожидаем.Что(РаспакованныеДанные, Компрессор).Равно(ИсходныеДанные);
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура Должен_ПроверитьУпаковкуРаспаковкуПотокаВПоток() Экспорт

	Компрессоры = Компрессоры();
	ИсходныеДанные = ТестовыеДвоичныеДанные();

	Для Каждого Компрессор Из Компрессоры Цикл
		Буфер = ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(ИсходныеДанные);
		ВходящийПоток = Новый ПотокВПамяти(Буфер);
		ИсходящийПоток = Новый ПотокВПамяти();
		Компрессор.Упаковать(ВходящийПоток, ИсходящийПоток);

		Буфер = ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(ИсходящийПоток.ЗакрытьИПолучитьДвоичныеДанные());
		ВходящийПоток = Новый ПотокВПамяти(Буфер);
		ИсходящийПоток = Новый ПотокВПамяти();
		Компрессор.Распаковать(ВходящийПоток, ИсходящийПоток);
		РаспакованныеДанные = ИсходящийПоток.ЗакрытьИПолучитьДвоичныеДанные();

		Ожидаем.Что(РаспакованныеДанные, Компрессор).Равно(ИсходныеДанные);
	КонецЦикла;

КонецПроцедуры

Функция Компрессоры()
	Массив = Новый Массив();
	Массив.Добавить(Новый GZipКомпрессор(УровеньСжатияДанных.Быстрый));
	Массив.Добавить(Новый DeflateКомпрессор());
	Массив.Добавить(Новый BrotliКомпрессор());

	Если МажорнаяВерсия() = "2" Тогда
		Массив.Добавить(Новый ZLibКомпрессор());
	КонецЕсли;

	Возврат Массив;
КонецФункции

Функция ТестовыеДвоичныеДанные()
	Возврат ПолучитьДвоичныеДанныеИзСтроки("David Albert Huffman");
КонецФункции

Функция МажорнаяВерсия()
	СИ = Новый СистемнаяИнформация();
    Возврат Лев(СИ.Версия, 1);
КонецФункции